'''列表推导式
L = [变量/表达式 for 变量 in 可迭代对象]
L = [变量/表达式 for 变量 in 可迭代对象 if 真值表达式]
L = [变量/表达式 for 变量1 in 可迭代对象 for 变量2 in 可迭代对象]
'''
#L = 【1，2，3，4，5，6，7，8，9】
L = [x for x in range(1,10)]
print(L)

#1-9中能被3整除的放入L中，L = 【3，6，9】
L = [x for x in range(1,10) if x%3==0]
print(L)

# L = [1,4,9,16,25...]
L = [x**2 for x in range(1,10)]
print(L)

#L = [1*1,1*2,1*3,2*1,2*3,2*3,3*1,3*2,3*3]
L = [x*y for x in [1,2,3] for y in [1,2,3]]
print(L)

#L = [1*1,1*3,2*1,2*3,3*1,3*3]
#L = [1*1,1*3,3*1,3*3]
#练习：程序输入一个整数，判断这个整数是否为素数
#素数即只能被1和其本身整数的数



