#创建空列表
L1 = []
#创建非空列表
L2 = [3,1,4]
L3 = [False,3.14,4]
#list()创建函数创建空列表
L4 = list()
#list(可迭代对象)创建非空列表
L5 = list(range(1,10))
L6 = list("ABCDEF")


L1 = [1,2,3,"a"]
L2 = [3.14,False,"abc"]

L3 = L1+L2
L4 = L1 *2
#L4 = L1 + "ABC"
#L5 = L1 +range(1,6)
print(L3)
print(L4)

x = [1,2,3]
y = [2,3,4]
b1 = x!=y
b2 = x>[1,2]
b3 = x<y
b4 = [1,3,2]>[1,2,3]
b5 = ["AB","CD"]>["AC","BD"]
#b6 = [1,"two"]>["two",1]

L  = list(range(9))#[0,1,2,3,4,5,6,7,8]
L1 = L[1:9:2]
print(L)#[0,1,2,3,4,5,6,7,8]
print(L1)#


L = [1,2,3,4]
L[1:3] = ["a","b","c"]
print(L)

L = ["a","b","c","d","e","f","g"]
L[1:5:2] = [1,2]
print(L)
#["a","b","c","d","e","f","g"] [1:5:2]来切，切出来的东西
# "b" "d"

L = [1,2,3]
L[0:2] = ["hello"]

L = [1,2,3]
L[0:2] = "hello"

L = [1,2,3,4,5,6]
L[3:-1] = ["hello"]

L = [3,4,6]#把L变成[1，2，3，4，5，6，7，8，9]，要求使用切片赋值





