'''序列传参'''

def f1(x,y,z):
    print(x,y,z)
str = [1,2,3]
f1(*str)
'''关键字传参'''

def f2(a,b,c):
    print(a,b,c)
f2(a=22,b=55,c=77)
f2(c=44,a=66,b=88)

'''字典关键字传参'''
def f3(name,id,age):
    print(name,id,age)

dic = {"id":1001,"age":20,"name":"张三"}
f3(**dic)

#练习，判断以下函数的调用是否正确，并且说明什么方式的组合
def f4(a,b,c):
    pass
f4(100,*[200,300])
f4(*"AB",300)
f4(100,c=200,b=300)
f4(1,**{"c":100,"b":200})
f4(**{"c":100,"b":200},a=300)
f4(b=1,c=2,3)
#原则，传参时，先位置传参，再关键字传参
#序列传参从本质是位置传参，字典关键字的本质是关键字传参



